## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [1]:
# Your code here - remember to use markdown cells for comments as well!

In [2]:
# Import necessary libraries
import pandas as pd             # For data manipulation and analysis
import matplotlib.pyplot as plt # For creating data visualizations
import numpy as np              # For numerical operations
import zipfile                  # For working with compressed files
import sqlite3                  # For working with SQLite databases

# Enable inline plotting for Jupyter Notebook or Jupyter Lab
%matplotlib inline

# Set an option to display all columns when viewing DataFrames
pd.set_option('display.max_columns', None)

In [3]:
reviews = pd.read_csv('zippedData\\rt.reviews.tsv.gz', sep='\t', compression='gzip', encoding='latin1')

reviews = reviews[['id','fresh']]
reviews.head()

   id   fresh
0   3   fresh
1   3  rotten
2   3   fresh
3   3   fresh
4   3   fresh

In [4]:
movie_info = pd.read_csv('zippedData\\rt.movie_info.tsv.gz', sep='\t', compression='gzip', encoding='latin1')
movie_info= movie_info[['id','genre']]

movie_info.head()

   id                                genre
0   1  Action and Adventure|Classics|Drama
1   3    Drama|Science Fiction and Fantasy
2   5    Drama|Musical and Performing Arts
3   6           Drama|Mystery and Suspense
4   7                        Drama|Romance

In [5]:
movies_details = pd.read_csv('zippedData\\tmdb.movies.csv.gz', compression='gzip', encoding='latin1')
movies_details = movies_details[['genre_ids', 'vote_average', 'vote_count']]
movies_details.head()

             genre_ids  vote_average  vote_count
0      [12, 14, 10751]           7.7       10788
1  [14, 12, 16, 10751]           7.7        7610
2        [12, 28, 878]           6.8       12368
3      [16, 35, 10751]           7.9       10174
4        [28, 878, 12]           8.3       22186

In [6]:
movies_budgets = pd.read_csv('zippedData\\tn.movie_budgets.csv.gz', compression='gzip', encoding='latin1')
movies_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [7]:
movie_gross = pd.read_csv('zippedData\\bom.movie_gross.csv.gz', compression='gzip', encoding='latin1')
movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [8]:
with zipfile.ZipFile('zippedData\im.db.zip', 'r') as zip_file:
    zip_file.extractall()

conn = sqlite3.connect('im.db')
persons = pd.read_sql("SELECT * FROM persons;", conn)
movie_basics = pd.read_sql("SELECT * FROM movie_basics;", conn)
movie_ratings = pd.read_sql("SELECT * FROM movie_ratings;", conn)
movie_aka = pd.read_sql("SELECT * FROM movie_akas;", conn)
writers = pd.read_sql("SELECT * FROM writers;", conn)
directors = pd.read_sql("SELECT * FROM directors;", conn)
known_for = pd.read_sql("SELECT * FROM known_for;", conn)
principals = pd.read_sql("SELECT * FROM principals;", conn)

conn.close()

In [9]:
movie_basics.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [10]:
movie_ratings.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [11]:
movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [12]:
tomatodata = pd.merge(reviews, movie_info, on= 'id', how = 'left')
tomatodata.head()

   id   fresh                              genre
0   3   fresh  Drama|Science Fiction and Fantasy
1   3  rotten  Drama|Science Fiction and Fantasy
2   3   fresh  Drama|Science Fiction and Fantasy
3   3   fresh  Drama|Science Fiction and Fantasy
4   3   fresh  Drama|Science Fiction and Fantasy

In [13]:
tmdbGenre = {28: 'Action',
 12: 'Adventure',
 16: 'Animation',
 35: 'Comedy',
 80: 'Crime',
 99: 'Documentary',
 18: 'Drama',
 10751: 'Family',
 14: 'Fantasy',
 36: 'History',
 27: 'Horror',
 10402: 'Music',
 9648: 'Mystery',
 10749: 'Romance',
 878: 'Science Fiction',
 10770: 'TV Movie',
 53: 'Thriller',
 10752: 'War',
 37: 'Western'}

In [22]:
movies_details['genre_ids']

genre_ids       0
vote_average    0
vote_count      0
dtype: int64